RohithSai4518/Embeded_Systems/include/registers/reg_nrf52840.h
/**
 * @file reg_nrf52840.h
 * @brief Nordic nRF52840 Peripheral Registers
 * @copyright Clean-room proprietary implementation. Zero GPL/Apache code.
 */

#ifndef REG_NRF52840_H
#define REG_NRF52840_H

#include <stdint.h>

#ifdef __cplusplus
extern "C" {
#endif

typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_RADIO_TypeDef;
#define NRF_RADIO ((NRF_RADIO_TypeDef *)0x40000000UL)

#define NRF_RADIO_BIT_0 (1UL << 0)
#define NRF_RADIO_BIT_1 (1UL << 1)
#define NRF_RADIO_BIT_2 (1UL << 2)
#define NRF_RADIO_BIT_3 (1UL << 3)
#define NRF_RADIO_BIT_4 (1UL << 4)
#define NRF_RADIO_BIT_5 (1UL << 5)
#define NRF_RADIO_BIT_6 (1UL << 6)
#define NRF_RADIO_BIT_7 (1UL << 7)
#define NRF_RADIO_BIT_8 (1UL << 8)
#define NRF_RADIO_BIT_9 (1UL << 9)
#define NRF_RADIO_BIT_10 (1UL << 10)
#define NRF_RADIO_BIT_11 (1UL << 11)
#define NRF_RADIO_BIT_12 (1UL << 12)
#define NRF_RADIO_BIT_13 (1UL << 13)
#define NRF_RADIO_BIT_14 (1UL << 14)
#define NRF_RADIO_BIT_15 (1UL << 15)
#define NRF_RADIO_BIT_16 (1UL << 16)
#define NRF_RADIO_BIT_17 (1UL << 17)
#define NRF_RADIO_BIT_18 (1UL << 18)
#define NRF_RADIO_BIT_19 (1UL << 19)
#define NRF_RADIO_BIT_20 (1UL << 20)
#define NRF_RADIO_BIT_21 (1UL << 21)
#define NRF_RADIO_BIT_22 (1UL << 22)
#define NRF_RADIO_BIT_23 (1UL << 23)
#define NRF_RADIO_BIT_24 (1UL << 24)
#define NRF_RADIO_BIT_25 (1UL << 25)
#define NRF_RADIO_BIT_26 (1UL << 26)
#define NRF_RADIO_BIT_27 (1UL << 27)
#define NRF_RADIO_BIT_28 (1UL << 28)
#define NRF_RADIO_BIT_29 (1UL << 29)
#define NRF_RADIO_BIT_30 (1UL << 30)
#define NRF_RADIO_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_TIMER0_TypeDef;
#define NRF_TIMER0 ((NRF_TIMER0_TypeDef *)0x40000000UL)

#define NRF_TIMER0_BIT_0 (1UL << 0)
#define NRF_TIMER0_BIT_1 (1UL << 1)
#define NRF_TIMER0_BIT_2 (1UL << 2)
#define NRF_TIMER0_BIT_3 (1UL << 3)
#define NRF_TIMER0_BIT_4 (1UL << 4)
#define NRF_TIMER0_BIT_5 (1UL << 5)
#define NRF_TIMER0_BIT_6 (1UL << 6)
#define NRF_TIMER0_BIT_7 (1UL << 7)
#define NRF_TIMER0_BIT_8 (1UL << 8)
#define NRF_TIMER0_BIT_9 (1UL << 9)
#define NRF_TIMER0_BIT_10 (1UL << 10)
#define NRF_TIMER0_BIT_11 (1UL << 11)
#define NRF_TIMER0_BIT_12 (1UL << 12)
#define NRF_TIMER0_BIT_13 (1UL << 13)
#define NRF_TIMER0_BIT_14 (1UL << 14)
#define NRF_TIMER0_BIT_15 (1UL << 15)
#define NRF_TIMER0_BIT_16 (1UL << 16)
#define NRF_TIMER0_BIT_17 (1UL << 17)
#define NRF_TIMER0_BIT_18 (1UL << 18)
#define NRF_TIMER0_BIT_19 (1UL << 19)
#define NRF_TIMER0_BIT_20 (1UL << 20)
#define NRF_TIMER0_BIT_21 (1UL << 21)
#define NRF_TIMER0_BIT_22 (1UL << 22)
#define NRF_TIMER0_BIT_23 (1UL << 23)
#define NRF_TIMER0_BIT_24 (1UL << 24)
#define NRF_TIMER0_BIT_25 (1UL << 25)
#define NRF_TIMER0_BIT_26 (1UL << 26)
#define NRF_TIMER0_BIT_27 (1UL << 27)
#define NRF_TIMER0_BIT_28 (1UL << 28)
#define NRF_TIMER0_BIT_29 (1UL << 29)
#define NRF_TIMER0_BIT_30 (1UL << 30)
#define NRF_TIMER0_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_TIMER1_TypeDef;
#define NRF_TIMER1 ((NRF_TIMER1_TypeDef *)0x40000000UL)

#define NRF_TIMER1_BIT_0 (1UL << 0)
#define NRF_TIMER1_BIT_1 (1UL << 1)
#define NRF_TIMER1_BIT_2 (1UL << 2)
#define NRF_TIMER1_BIT_3 (1UL << 3)
#define NRF_TIMER1_BIT_4 (1UL << 4)
#define NRF_TIMER1_BIT_5 (1UL << 5)
#define NRF_TIMER1_BIT_6 (1UL << 6)
#define NRF_TIMER1_BIT_7 (1UL << 7)
#define NRF_TIMER1_BIT_8 (1UL << 8)
#define NRF_TIMER1_BIT_9 (1UL << 9)
#define NRF_TIMER1_BIT_10 (1UL << 10)
#define NRF_TIMER1_BIT_11 (1UL << 11)
#define NRF_TIMER1_BIT_12 (1UL << 12)
#define NRF_TIMER1_BIT_13 (1UL << 13)
#define NRF_TIMER1_BIT_14 (1UL << 14)
#define NRF_TIMER1_BIT_15 (1UL << 15)
#define NRF_TIMER1_BIT_16 (1UL << 16)
#define NRF_TIMER1_BIT_17 (1UL << 17)
#define NRF_TIMER1_BIT_18 (1UL << 18)
#define NRF_TIMER1_BIT_19 (1UL << 19)
#define NRF_TIMER1_BIT_20 (1UL << 20)
#define NRF_TIMER1_BIT_21 (1UL << 21)
#define NRF_TIMER1_BIT_22 (1UL << 22)
#define NRF_TIMER1_BIT_23 (1UL << 23)
#define NRF_TIMER1_BIT_24 (1UL << 24)
#define NRF_TIMER1_BIT_25 (1UL << 25)
#define NRF_TIMER1_BIT_26 (1UL << 26)
#define NRF_TIMER1_BIT_27 (1UL << 27)
#define NRF_TIMER1_BIT_28 (1UL << 28)
#define NRF_TIMER1_BIT_29 (1UL << 29)
#define NRF_TIMER1_BIT_30 (1UL << 30)
#define NRF_TIMER1_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_TIMER2_TypeDef;
#define NRF_TIMER2 ((NRF_TIMER2_TypeDef *)0x40000000UL)

#define NRF_TIMER2_BIT_0 (1UL << 0)
#define NRF_TIMER2_BIT_1 (1UL << 1)
#define NRF_TIMER2_BIT_2 (1UL << 2)
#define NRF_TIMER2_BIT_3 (1UL << 3)
#define NRF_TIMER2_BIT_4 (1UL << 4)
#define NRF_TIMER2_BIT_5 (1UL << 5)
#define NRF_TIMER2_BIT_6 (1UL << 6)
#define NRF_TIMER2_BIT_7 (1UL << 7)
#define NRF_TIMER2_BIT_8 (1UL << 8)
#define NRF_TIMER2_BIT_9 (1UL << 9)
#define NRF_TIMER2_BIT_10 (1UL << 10)
#define NRF_TIMER2_BIT_11 (1UL << 11)
#define NRF_TIMER2_BIT_12 (1UL << 12)
#define NRF_TIMER2_BIT_13 (1UL << 13)
#define NRF_TIMER2_BIT_14 (1UL << 14)
#define NRF_TIMER2_BIT_15 (1UL << 15)
#define NRF_TIMER2_BIT_16 (1UL << 16)
#define NRF_TIMER2_BIT_17 (1UL << 17)
#define NRF_TIMER2_BIT_18 (1UL << 18)
#define NRF_TIMER2_BIT_19 (1UL << 19)
#define NRF_TIMER2_BIT_20 (1UL << 20)
#define NRF_TIMER2_BIT_21 (1UL << 21)
#define NRF_TIMER2_BIT_22 (1UL << 22)
#define NRF_TIMER2_BIT_23 (1UL << 23)
#define NRF_TIMER2_BIT_24 (1UL << 24)
#define NRF_TIMER2_BIT_25 (1UL << 25)
#define NRF_TIMER2_BIT_26 (1UL << 26)
#define NRF_TIMER2_BIT_27 (1UL << 27)
#define NRF_TIMER2_BIT_28 (1UL << 28)
#define NRF_TIMER2_BIT_29 (1UL << 29)
#define NRF_TIMER2_BIT_30 (1UL << 30)
#define NRF_TIMER2_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_TIMER3_TypeDef;
#define NRF_TIMER3 ((NRF_TIMER3_TypeDef *)0x40000000UL)

#define NRF_TIMER3_BIT_0 (1UL << 0)
#define NRF_TIMER3_BIT_1 (1UL << 1)
#define NRF_TIMER3_BIT_2 (1UL << 2)
#define NRF_TIMER3_BIT_3 (1UL << 3)
#define NRF_TIMER3_BIT_4 (1UL << 4)
#define NRF_TIMER3_BIT_5 (1UL << 5)
#define NRF_TIMER3_BIT_6 (1UL << 6)
#define NRF_TIMER3_BIT_7 (1UL << 7)
#define NRF_TIMER3_BIT_8 (1UL << 8)
#define NRF_TIMER3_BIT_9 (1UL << 9)
#define NRF_TIMER3_BIT_10 (1UL << 10)
#define NRF_TIMER3_BIT_11 (1UL << 11)
#define NRF_TIMER3_BIT_12 (1UL << 12)
#define NRF_TIMER3_BIT_13 (1UL << 13)
#define NRF_TIMER3_BIT_14 (1UL << 14)
#define NRF_TIMER3_BIT_15 (1UL << 15)
#define NRF_TIMER3_BIT_16 (1UL << 16)
#define NRF_TIMER3_BIT_17 (1UL << 17)
#define NRF_TIMER3_BIT_18 (1UL << 18)
#define NRF_TIMER3_BIT_19 (1UL << 19)
#define NRF_TIMER3_BIT_20 (1UL << 20)
#define NRF_TIMER3_BIT_21 (1UL << 21)
#define NRF_TIMER3_BIT_22 (1UL << 22)
#define NRF_TIMER3_BIT_23 (1UL << 23)
#define NRF_TIMER3_BIT_24 (1UL << 24)
#define NRF_TIMER3_BIT_25 (1UL << 25)
#define NRF_TIMER3_BIT_26 (1UL << 26)
#define NRF_TIMER3_BIT_27 (1UL << 27)
#define NRF_TIMER3_BIT_28 (1UL << 28)
#define NRF_TIMER3_BIT_29 (1UL << 29)
#define NRF_TIMER3_BIT_30 (1UL << 30)
#define NRF_TIMER3_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_TIMER4_TypeDef;
#define NRF_TIMER4 ((NRF_TIMER4_TypeDef *)0x40000000UL)

#define NRF_TIMER4_BIT_0 (1UL << 0)
#define NRF_TIMER4_BIT_1 (1UL << 1)
#define NRF_TIMER4_BIT_2 (1UL << 2)
#define NRF_TIMER4_BIT_3 (1UL << 3)
#define NRF_TIMER4_BIT_4 (1UL << 4)
#define NRF_TIMER4_BIT_5 (1UL << 5)
#define NRF_TIMER4_BIT_6 (1UL << 6)
#define NRF_TIMER4_BIT_7 (1UL << 7)
#define NRF_TIMER4_BIT_8 (1UL << 8)
#define NRF_TIMER4_BIT_9 (1UL << 9)
#define NRF_TIMER4_BIT_10 (1UL << 10)
#define NRF_TIMER4_BIT_11 (1UL << 11)
#define NRF_TIMER4_BIT_12 (1UL << 12)
#define NRF_TIMER4_BIT_13 (1UL << 13)
#define NRF_TIMER4_BIT_14 (1UL << 14)
#define NRF_TIMER4_BIT_15 (1UL << 15)
#define NRF_TIMER4_BIT_16 (1UL << 16)
#define NRF_TIMER4_BIT_17 (1UL << 17)
#define NRF_TIMER4_BIT_18 (1UL << 18)
#define NRF_TIMER4_BIT_19 (1UL << 19)
#define NRF_TIMER4_BIT_20 (1UL << 20)
#define NRF_TIMER4_BIT_21 (1UL << 21)
#define NRF_TIMER4_BIT_22 (1UL << 22)
#define NRF_TIMER4_BIT_23 (1UL << 23)
#define NRF_TIMER4_BIT_24 (1UL << 24)
#define NRF_TIMER4_BIT_25 (1UL << 25)
#define NRF_TIMER4_BIT_26 (1UL << 26)
#define NRF_TIMER4_BIT_27 (1UL << 27)
#define NRF_TIMER4_BIT_28 (1UL << 28)
#define NRF_TIMER4_BIT_29 (1UL << 29)
#define NRF_TIMER4_BIT_30 (1UL << 30)
#define NRF_TIMER4_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_RTC0_TypeDef;
#define NRF_RTC0 ((NRF_RTC0_TypeDef *)0x40000000UL)

#define NRF_RTC0_BIT_0 (1UL << 0)
#define NRF_RTC0_BIT_1 (1UL << 1)
#define NRF_RTC0_BIT_2 (1UL << 2)
#define NRF_RTC0_BIT_3 (1UL << 3)
#define NRF_RTC0_BIT_4 (1UL << 4)
#define NRF_RTC0_BIT_5 (1UL << 5)
#define NRF_RTC0_BIT_6 (1UL << 6)
#define NRF_RTC0_BIT_7 (1UL << 7)
#define NRF_RTC0_BIT_8 (1UL << 8)
#define NRF_RTC0_BIT_9 (1UL << 9)
#define NRF_RTC0_BIT_10 (1UL << 10)
#define NRF_RTC0_BIT_11 (1UL << 11)
#define NRF_RTC0_BIT_12 (1UL << 12)
#define NRF_RTC0_BIT_13 (1UL << 13)
#define NRF_RTC0_BIT_14 (1UL << 14)
#define NRF_RTC0_BIT_15 (1UL << 15)
#define NRF_RTC0_BIT_16 (1UL << 16)
#define NRF_RTC0_BIT_17 (1UL << 17)
#define NRF_RTC0_BIT_18 (1UL << 18)
#define NRF_RTC0_BIT_19 (1UL << 19)
#define NRF_RTC0_BIT_20 (1UL << 20)
#define NRF_RTC0_BIT_21 (1UL << 21)
#define NRF_RTC0_BIT_22 (1UL << 22)
#define NRF_RTC0_BIT_23 (1UL << 23)
#define NRF_RTC0_BIT_24 (1UL << 24)
#define NRF_RTC0_BIT_25 (1UL << 25)
#define NRF_RTC0_BIT_26 (1UL << 26)
#define NRF_RTC0_BIT_27 (1UL << 27)
#define NRF_RTC0_BIT_28 (1UL << 28)
#define NRF_RTC0_BIT_29 (1UL << 29)
#define NRF_RTC0_BIT_30 (1UL << 30)
#define NRF_RTC0_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_RTC1_TypeDef;
#define NRF_RTC1 ((NRF_RTC1_TypeDef *)0x40000000UL)

#define NRF_RTC1_BIT_0 (1UL << 0)
#define NRF_RTC1_BIT_1 (1UL << 1)
#define NRF_RTC1_BIT_2 (1UL << 2)
#define NRF_RTC1_BIT_3 (1UL << 3)
#define NRF_RTC1_BIT_4 (1UL << 4)
#define NRF_RTC1_BIT_5 (1UL << 5)
#define NRF_RTC1_BIT_6 (1UL << 6)
#define NRF_RTC1_BIT_7 (1UL << 7)
#define NRF_RTC1_BIT_8 (1UL << 8)
#define NRF_RTC1_BIT_9 (1UL << 9)
#define NRF_RTC1_BIT_10 (1UL << 10)
#define NRF_RTC1_BIT_11 (1UL << 11)
#define NRF_RTC1_BIT_12 (1UL << 12)
#define NRF_RTC1_BIT_13 (1UL << 13)
#define NRF_RTC1_BIT_14 (1UL << 14)
#define NRF_RTC1_BIT_15 (1UL << 15)
#define NRF_RTC1_BIT_16 (1UL << 16)
#define NRF_RTC1_BIT_17 (1UL << 17)
#define NRF_RTC1_BIT_18 (1UL << 18)
#define NRF_RTC1_BIT_19 (1UL << 19)
#define NRF_RTC1_BIT_20 (1UL << 20)
#define NRF_RTC1_BIT_21 (1UL << 21)
#define NRF_RTC1_BIT_22 (1UL << 22)
#define NRF_RTC1_BIT_23 (1UL << 23)
#define NRF_RTC1_BIT_24 (1UL << 24)
#define NRF_RTC1_BIT_25 (1UL << 25)
#define NRF_RTC1_BIT_26 (1UL << 26)
#define NRF_RTC1_BIT_27 (1UL << 27)
#define NRF_RTC1_BIT_28 (1UL << 28)
#define NRF_RTC1_BIT_29 (1UL << 29)
#define NRF_RTC1_BIT_30 (1UL << 30)
#define NRF_RTC1_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_RTC2_TypeDef;
#define NRF_RTC2 ((NRF_RTC2_TypeDef *)0x40000000UL)

