RohithSai4518/Embeded_Systems/include/registers/reg_nrf52840.h
#define NRF_RTC2_BIT_0 (1UL << 0)
#define NRF_RTC2_BIT_1 (1UL << 1)
#define NRF_RTC2_BIT_2 (1UL << 2)
#define NRF_RTC2_BIT_3 (1UL << 3)
#define NRF_RTC2_BIT_4 (1UL << 4)
#define NRF_RTC2_BIT_5 (1UL << 5)
#define NRF_RTC2_BIT_6 (1UL << 6)
#define NRF_RTC2_BIT_7 (1UL << 7)
#define NRF_RTC2_BIT_8 (1UL << 8)
#define NRF_RTC2_BIT_9 (1UL << 9)
#define NRF_RTC2_BIT_10 (1UL << 10)
#define NRF_RTC2_BIT_11 (1UL << 11)
#define NRF_RTC2_BIT_12 (1UL << 12)
#define NRF_RTC2_BIT_13 (1UL << 13)
#define NRF_RTC2_BIT_14 (1UL << 14)
#define NRF_RTC2_BIT_15 (1UL << 15)
#define NRF_RTC2_BIT_16 (1UL << 16)
#define NRF_RTC2_BIT_17 (1UL << 17)
#define NRF_RTC2_BIT_18 (1UL << 18)
#define NRF_RTC2_BIT_19 (1UL << 19)
#define NRF_RTC2_BIT_20 (1UL << 20)
#define NRF_RTC2_BIT_21 (1UL << 21)
#define NRF_RTC2_BIT_22 (1UL << 22)
#define NRF_RTC2_BIT_23 (1UL << 23)
#define NRF_RTC2_BIT_24 (1UL << 24)
#define NRF_RTC2_BIT_25 (1UL << 25)
#define NRF_RTC2_BIT_26 (1UL << 26)
#define NRF_RTC2_BIT_27 (1UL << 27)
#define NRF_RTC2_BIT_28 (1UL << 28)
#define NRF_RTC2_BIT_29 (1UL << 29)
#define NRF_RTC2_BIT_30 (1UL << 30)
#define NRF_RTC2_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_SAADC_TypeDef;
#define NRF_SAADC ((NRF_SAADC_TypeDef *)0x40000000UL)

#define NRF_SAADC_BIT_0 (1UL << 0)
#define NRF_SAADC_BIT_1 (1UL << 1)
#define NRF_SAADC_BIT_2 (1UL << 2)
#define NRF_SAADC_BIT_3 (1UL << 3)
#define NRF_SAADC_BIT_4 (1UL << 4)
#define NRF_SAADC_BIT_5 (1UL << 5)
#define NRF_SAADC_BIT_6 (1UL << 6)
#define NRF_SAADC_BIT_7 (1UL << 7)
#define NRF_SAADC_BIT_8 (1UL << 8)
#define NRF_SAADC_BIT_9 (1UL << 9)
#define NRF_SAADC_BIT_10 (1UL << 10)
#define NRF_SAADC_BIT_11 (1UL << 11)
#define NRF_SAADC_BIT_12 (1UL << 12)
#define NRF_SAADC_BIT_13 (1UL << 13)
#define NRF_SAADC_BIT_14 (1UL << 14)
#define NRF_SAADC_BIT_15 (1UL << 15)
#define NRF_SAADC_BIT_16 (1UL << 16)
#define NRF_SAADC_BIT_17 (1UL << 17)
#define NRF_SAADC_BIT_18 (1UL << 18)
#define NRF_SAADC_BIT_19 (1UL << 19)
#define NRF_SAADC_BIT_20 (1UL << 20)
#define NRF_SAADC_BIT_21 (1UL << 21)
#define NRF_SAADC_BIT_22 (1UL << 22)
#define NRF_SAADC_BIT_23 (1UL << 23)
#define NRF_SAADC_BIT_24 (1UL << 24)
#define NRF_SAADC_BIT_25 (1UL << 25)
#define NRF_SAADC_BIT_26 (1UL << 26)
#define NRF_SAADC_BIT_27 (1UL << 27)
#define NRF_SAADC_BIT_28 (1UL << 28)
#define NRF_SAADC_BIT_29 (1UL << 29)
#define NRF_SAADC_BIT_30 (1UL << 30)
#define NRF_SAADC_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_PPI_TypeDef;
#define NRF_PPI ((NRF_PPI_TypeDef *)0x40000000UL)

#define NRF_PPI_BIT_0 (1UL << 0)
#define NRF_PPI_BIT_1 (1UL << 1)
#define NRF_PPI_BIT_2 (1UL << 2)
#define NRF_PPI_BIT_3 (1UL << 3)
#define NRF_PPI_BIT_4 (1UL << 4)
#define NRF_PPI_BIT_5 (1UL << 5)
#define NRF_PPI_BIT_6 (1UL << 6)
#define NRF_PPI_BIT_7 (1UL << 7)
#define NRF_PPI_BIT_8 (1UL << 8)
#define NRF_PPI_BIT_9 (1UL << 9)
#define NRF_PPI_BIT_10 (1UL << 10)
#define NRF_PPI_BIT_11 (1UL << 11)
#define NRF_PPI_BIT_12 (1UL << 12)
#define NRF_PPI_BIT_13 (1UL << 13)
#define NRF_PPI_BIT_14 (1UL << 14)
#define NRF_PPI_BIT_15 (1UL << 15)
#define NRF_PPI_BIT_16 (1UL << 16)
#define NRF_PPI_BIT_17 (1UL << 17)
#define NRF_PPI_BIT_18 (1UL << 18)
#define NRF_PPI_BIT_19 (1UL << 19)
#define NRF_PPI_BIT_20 (1UL << 20)
#define NRF_PPI_BIT_21 (1UL << 21)
#define NRF_PPI_BIT_22 (1UL << 22)
#define NRF_PPI_BIT_23 (1UL << 23)
#define NRF_PPI_BIT_24 (1UL << 24)
#define NRF_PPI_BIT_25 (1UL << 25)
#define NRF_PPI_BIT_26 (1UL << 26)
#define NRF_PPI_BIT_27 (1UL << 27)
#define NRF_PPI_BIT_28 (1UL << 28)
#define NRF_PPI_BIT_29 (1UL << 29)
#define NRF_PPI_BIT_30 (1UL << 30)
#define NRF_PPI_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_GPIOTE_TypeDef;
#define NRF_GPIOTE ((NRF_GPIOTE_TypeDef *)0x40000000UL)

#define NRF_GPIOTE_BIT_0 (1UL << 0)
#define NRF_GPIOTE_BIT_1 (1UL << 1)
#define NRF_GPIOTE_BIT_2 (1UL << 2)
#define NRF_GPIOTE_BIT_3 (1UL << 3)
#define NRF_GPIOTE_BIT_4 (1UL << 4)
#define NRF_GPIOTE_BIT_5 (1UL << 5)
#define NRF_GPIOTE_BIT_6 (1UL << 6)
#define NRF_GPIOTE_BIT_7 (1UL << 7)
#define NRF_GPIOTE_BIT_8 (1UL << 8)
#define NRF_GPIOTE_BIT_9 (1UL << 9)
#define NRF_GPIOTE_BIT_10 (1UL << 10)
#define NRF_GPIOTE_BIT_11 (1UL << 11)
#define NRF_GPIOTE_BIT_12 (1UL << 12)
#define NRF_GPIOTE_BIT_13 (1UL << 13)
#define NRF_GPIOTE_BIT_14 (1UL << 14)
#define NRF_GPIOTE_BIT_15 (1UL << 15)
#define NRF_GPIOTE_BIT_16 (1UL << 16)
#define NRF_GPIOTE_BIT_17 (1UL << 17)
#define NRF_GPIOTE_BIT_18 (1UL << 18)
#define NRF_GPIOTE_BIT_19 (1UL << 19)
#define NRF_GPIOTE_BIT_20 (1UL << 20)
#define NRF_GPIOTE_BIT_21 (1UL << 21)
#define NRF_GPIOTE_BIT_22 (1UL << 22)
#define NRF_GPIOTE_BIT_23 (1UL << 23)
#define NRF_GPIOTE_BIT_24 (1UL << 24)
#define NRF_GPIOTE_BIT_25 (1UL << 25)
#define NRF_GPIOTE_BIT_26 (1UL << 26)
#define NRF_GPIOTE_BIT_27 (1UL << 27)
#define NRF_GPIOTE_BIT_28 (1UL << 28)
#define NRF_GPIOTE_BIT_29 (1UL << 29)
#define NRF_GPIOTE_BIT_30 (1UL << 30)
#define NRF_GPIOTE_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_WDT_TypeDef;
#define NRF_WDT ((NRF_WDT_TypeDef *)0x40000000UL)

#define NRF_WDT_BIT_0 (1UL << 0)
#define NRF_WDT_BIT_1 (1UL << 1)
#define NRF_WDT_BIT_2 (1UL << 2)
#define NRF_WDT_BIT_3 (1UL << 3)
#define NRF_WDT_BIT_4 (1UL << 4)
#define NRF_WDT_BIT_5 (1UL << 5)
#define NRF_WDT_BIT_6 (1UL << 6)
#define NRF_WDT_BIT_7 (1UL << 7)
#define NRF_WDT_BIT_8 (1UL << 8)
#define NRF_WDT_BIT_9 (1UL << 9)
#define NRF_WDT_BIT_10 (1UL << 10)
#define NRF_WDT_BIT_11 (1UL << 11)
#define NRF_WDT_BIT_12 (1UL << 12)
#define NRF_WDT_BIT_13 (1UL << 13)
#define NRF_WDT_BIT_14 (1UL << 14)
#define NRF_WDT_BIT_15 (1UL << 15)
#define NRF_WDT_BIT_16 (1UL << 16)
#define NRF_WDT_BIT_17 (1UL << 17)
#define NRF_WDT_BIT_18 (1UL << 18)
#define NRF_WDT_BIT_19 (1UL << 19)
#define NRF_WDT_BIT_20 (1UL << 20)
#define NRF_WDT_BIT_21 (1UL << 21)
#define NRF_WDT_BIT_22 (1UL << 22)
#define NRF_WDT_BIT_23 (1UL << 23)
#define NRF_WDT_BIT_24 (1UL << 24)
#define NRF_WDT_BIT_25 (1UL << 25)
#define NRF_WDT_BIT_26 (1UL << 26)
#define NRF_WDT_BIT_27 (1UL << 27)
#define NRF_WDT_BIT_28 (1UL << 28)
#define NRF_WDT_BIT_29 (1UL << 29)
#define NRF_WDT_BIT_30 (1UL << 30)
#define NRF_WDT_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_UARTE0_TypeDef;
#define NRF_UARTE0 ((NRF_UARTE0_TypeDef *)0x40000000UL)

#define NRF_UARTE0_BIT_0 (1UL << 0)
#define NRF_UARTE0_BIT_1 (1UL << 1)
#define NRF_UARTE0_BIT_2 (1UL << 2)
#define NRF_UARTE0_BIT_3 (1UL << 3)
#define NRF_UARTE0_BIT_4 (1UL << 4)
#define NRF_UARTE0_BIT_5 (1UL << 5)
#define NRF_UARTE0_BIT_6 (1UL << 6)
#define NRF_UARTE0_BIT_7 (1UL << 7)
#define NRF_UARTE0_BIT_8 (1UL << 8)
#define NRF_UARTE0_BIT_9 (1UL << 9)
#define NRF_UARTE0_BIT_10 (1UL << 10)
#define NRF_UARTE0_BIT_11 (1UL << 11)
#define NRF_UARTE0_BIT_12 (1UL << 12)
#define NRF_UARTE0_BIT_13 (1UL << 13)
#define NRF_UARTE0_BIT_14 (1UL << 14)
#define NRF_UARTE0_BIT_15 (1UL << 15)
#define NRF_UARTE0_BIT_16 (1UL << 16)
#define NRF_UARTE0_BIT_17 (1UL << 17)
#define NRF_UARTE0_BIT_18 (1UL << 18)
#define NRF_UARTE0_BIT_19 (1UL << 19)
#define NRF_UARTE0_BIT_20 (1UL << 20)
#define NRF_UARTE0_BIT_21 (1UL << 21)
#define NRF_UARTE0_BIT_22 (1UL << 22)
#define NRF_UARTE0_BIT_23 (1UL << 23)
#define NRF_UARTE0_BIT_24 (1UL << 24)
#define NRF_UARTE0_BIT_25 (1UL << 25)
#define NRF_UARTE0_BIT_26 (1UL << 26)
#define NRF_UARTE0_BIT_27 (1UL << 27)
#define NRF_UARTE0_BIT_28 (1UL << 28)
#define NRF_UARTE0_BIT_29 (1UL << 29)
#define NRF_UARTE0_BIT_30 (1UL << 30)
#define NRF_UARTE0_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_UARTE1_TypeDef;
#define NRF_UARTE1 ((NRF_UARTE1_TypeDef *)0x40000000UL)

