RohithSai4518/Embeded_Systems/include/registers/reg_nrf52840.h
#define NRF_UARTE1_BIT_0 (1UL << 0)
#define NRF_UARTE1_BIT_1 (1UL << 1)
#define NRF_UARTE1_BIT_2 (1UL << 2)
#define NRF_UARTE1_BIT_3 (1UL << 3)
#define NRF_UARTE1_BIT_4 (1UL << 4)
#define NRF_UARTE1_BIT_5 (1UL << 5)
#define NRF_UARTE1_BIT_6 (1UL << 6)
#define NRF_UARTE1_BIT_7 (1UL << 7)
#define NRF_UARTE1_BIT_8 (1UL << 8)
#define NRF_UARTE1_BIT_9 (1UL << 9)
#define NRF_UARTE1_BIT_10 (1UL << 10)
#define NRF_UARTE1_BIT_11 (1UL << 11)
#define NRF_UARTE1_BIT_12 (1UL << 12)
#define NRF_UARTE1_BIT_13 (1UL << 13)
#define NRF_UARTE1_BIT_14 (1UL << 14)
#define NRF_UARTE1_BIT_15 (1UL << 15)
#define NRF_UARTE1_BIT_16 (1UL << 16)
#define NRF_UARTE1_BIT_17 (1UL << 17)
#define NRF_UARTE1_BIT_18 (1UL << 18)
#define NRF_UARTE1_BIT_19 (1UL << 19)
#define NRF_UARTE1_BIT_20 (1UL << 20)
#define NRF_UARTE1_BIT_21 (1UL << 21)
#define NRF_UARTE1_BIT_22 (1UL << 22)
#define NRF_UARTE1_BIT_23 (1UL << 23)
#define NRF_UARTE1_BIT_24 (1UL << 24)
#define NRF_UARTE1_BIT_25 (1UL << 25)
#define NRF_UARTE1_BIT_26 (1UL << 26)
#define NRF_UARTE1_BIT_27 (1UL << 27)
#define NRF_UARTE1_BIT_28 (1UL << 28)
#define NRF_UARTE1_BIT_29 (1UL << 29)
#define NRF_UARTE1_BIT_30 (1UL << 30)
#define NRF_UARTE1_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_SPIM0_TypeDef;
#define NRF_SPIM0 ((NRF_SPIM0_TypeDef *)0x40000000UL)

#define NRF_SPIM0_BIT_0 (1UL << 0)
#define NRF_SPIM0_BIT_1 (1UL << 1)
#define NRF_SPIM0_BIT_2 (1UL << 2)
#define NRF_SPIM0_BIT_3 (1UL << 3)
#define NRF_SPIM0_BIT_4 (1UL << 4)
#define NRF_SPIM0_BIT_5 (1UL << 5)
#define NRF_SPIM0_BIT_6 (1UL << 6)
#define NRF_SPIM0_BIT_7 (1UL << 7)
#define NRF_SPIM0_BIT_8 (1UL << 8)
#define NRF_SPIM0_BIT_9 (1UL << 9)
#define NRF_SPIM0_BIT_10 (1UL << 10)
#define NRF_SPIM0_BIT_11 (1UL << 11)
#define NRF_SPIM0_BIT_12 (1UL << 12)
#define NRF_SPIM0_BIT_13 (1UL << 13)
#define NRF_SPIM0_BIT_14 (1UL << 14)
#define NRF_SPIM0_BIT_15 (1UL << 15)
#define NRF_SPIM0_BIT_16 (1UL << 16)
#define NRF_SPIM0_BIT_17 (1UL << 17)
#define NRF_SPIM0_BIT_18 (1UL << 18)
#define NRF_SPIM0_BIT_19 (1UL << 19)
#define NRF_SPIM0_BIT_20 (1UL << 20)
#define NRF_SPIM0_BIT_21 (1UL << 21)
#define NRF_SPIM0_BIT_22 (1UL << 22)
#define NRF_SPIM0_BIT_23 (1UL << 23)
#define NRF_SPIM0_BIT_24 (1UL << 24)
#define NRF_SPIM0_BIT_25 (1UL << 25)
#define NRF_SPIM0_BIT_26 (1UL << 26)
#define NRF_SPIM0_BIT_27 (1UL << 27)
#define NRF_SPIM0_BIT_28 (1UL << 28)
#define NRF_SPIM0_BIT_29 (1UL << 29)
#define NRF_SPIM0_BIT_30 (1UL << 30)
#define NRF_SPIM0_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_SPIM1_TypeDef;
#define NRF_SPIM1 ((NRF_SPIM1_TypeDef *)0x40000000UL)

#define NRF_SPIM1_BIT_0 (1UL << 0)
#define NRF_SPIM1_BIT_1 (1UL << 1)
#define NRF_SPIM1_BIT_2 (1UL << 2)
#define NRF_SPIM1_BIT_3 (1UL << 3)
#define NRF_SPIM1_BIT_4 (1UL << 4)
#define NRF_SPIM1_BIT_5 (1UL << 5)
#define NRF_SPIM1_BIT_6 (1UL << 6)
#define NRF_SPIM1_BIT_7 (1UL << 7)
#define NRF_SPIM1_BIT_8 (1UL << 8)
#define NRF_SPIM1_BIT_9 (1UL << 9)
#define NRF_SPIM1_BIT_10 (1UL << 10)
#define NRF_SPIM1_BIT_11 (1UL << 11)
#define NRF_SPIM1_BIT_12 (1UL << 12)
#define NRF_SPIM1_BIT_13 (1UL << 13)
#define NRF_SPIM1_BIT_14 (1UL << 14)
#define NRF_SPIM1_BIT_15 (1UL << 15)
#define NRF_SPIM1_BIT_16 (1UL << 16)
#define NRF_SPIM1_BIT_17 (1UL << 17)
#define NRF_SPIM1_BIT_18 (1UL << 18)
#define NRF_SPIM1_BIT_19 (1UL << 19)
#define NRF_SPIM1_BIT_20 (1UL << 20)
#define NRF_SPIM1_BIT_21 (1UL << 21)
#define NRF_SPIM1_BIT_22 (1UL << 22)
#define NRF_SPIM1_BIT_23 (1UL << 23)
#define NRF_SPIM1_BIT_24 (1UL << 24)
#define NRF_SPIM1_BIT_25 (1UL << 25)
#define NRF_SPIM1_BIT_26 (1UL << 26)
#define NRF_SPIM1_BIT_27 (1UL << 27)
#define NRF_SPIM1_BIT_28 (1UL << 28)
#define NRF_SPIM1_BIT_29 (1UL << 29)
#define NRF_SPIM1_BIT_30 (1UL << 30)
#define NRF_SPIM1_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_SPIM2_TypeDef;
#define NRF_SPIM2 ((NRF_SPIM2_TypeDef *)0x40000000UL)

#define NRF_SPIM2_BIT_0 (1UL << 0)
#define NRF_SPIM2_BIT_1 (1UL << 1)
#define NRF_SPIM2_BIT_2 (1UL << 2)
#define NRF_SPIM2_BIT_3 (1UL << 3)
#define NRF_SPIM2_BIT_4 (1UL << 4)
#define NRF_SPIM2_BIT_5 (1UL << 5)
#define NRF_SPIM2_BIT_6 (1UL << 6)
#define NRF_SPIM2_BIT_7 (1UL << 7)
#define NRF_SPIM2_BIT_8 (1UL << 8)
#define NRF_SPIM2_BIT_9 (1UL << 9)
#define NRF_SPIM2_BIT_10 (1UL << 10)
#define NRF_SPIM2_BIT_11 (1UL << 11)
#define NRF_SPIM2_BIT_12 (1UL << 12)
#define NRF_SPIM2_BIT_13 (1UL << 13)
#define NRF_SPIM2_BIT_14 (1UL << 14)
#define NRF_SPIM2_BIT_15 (1UL << 15)
#define NRF_SPIM2_BIT_16 (1UL << 16)
#define NRF_SPIM2_BIT_17 (1UL << 17)
#define NRF_SPIM2_BIT_18 (1UL << 18)
#define NRF_SPIM2_BIT_19 (1UL << 19)
#define NRF_SPIM2_BIT_20 (1UL << 20)
#define NRF_SPIM2_BIT_21 (1UL << 21)
#define NRF_SPIM2_BIT_22 (1UL << 22)
#define NRF_SPIM2_BIT_23 (1UL << 23)
#define NRF_SPIM2_BIT_24 (1UL << 24)
#define NRF_SPIM2_BIT_25 (1UL << 25)
#define NRF_SPIM2_BIT_26 (1UL << 26)
#define NRF_SPIM2_BIT_27 (1UL << 27)
#define NRF_SPIM2_BIT_28 (1UL << 28)
#define NRF_SPIM2_BIT_29 (1UL << 29)
#define NRF_SPIM2_BIT_30 (1UL << 30)
#define NRF_SPIM2_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_SPIM3_TypeDef;
#define NRF_SPIM3 ((NRF_SPIM3_TypeDef *)0x40000000UL)

#define NRF_SPIM3_BIT_0 (1UL << 0)
#define NRF_SPIM3_BIT_1 (1UL << 1)
#define NRF_SPIM3_BIT_2 (1UL << 2)
#define NRF_SPIM3_BIT_3 (1UL << 3)
#define NRF_SPIM3_BIT_4 (1UL << 4)
#define NRF_SPIM3_BIT_5 (1UL << 5)
#define NRF_SPIM3_BIT_6 (1UL << 6)
#define NRF_SPIM3_BIT_7 (1UL << 7)
#define NRF_SPIM3_BIT_8 (1UL << 8)
#define NRF_SPIM3_BIT_9 (1UL << 9)
#define NRF_SPIM3_BIT_10 (1UL << 10)
#define NRF_SPIM3_BIT_11 (1UL << 11)
#define NRF_SPIM3_BIT_12 (1UL << 12)
#define NRF_SPIM3_BIT_13 (1UL << 13)
#define NRF_SPIM3_BIT_14 (1UL << 14)
#define NRF_SPIM3_BIT_15 (1UL << 15)
#define NRF_SPIM3_BIT_16 (1UL << 16)
#define NRF_SPIM3_BIT_17 (1UL << 17)
#define NRF_SPIM3_BIT_18 (1UL << 18)
#define NRF_SPIM3_BIT_19 (1UL << 19)
#define NRF_SPIM3_BIT_20 (1UL << 20)
#define NRF_SPIM3_BIT_21 (1UL << 21)
#define NRF_SPIM3_BIT_22 (1UL << 22)
#define NRF_SPIM3_BIT_23 (1UL << 23)
#define NRF_SPIM3_BIT_24 (1UL << 24)
#define NRF_SPIM3_BIT_25 (1UL << 25)
#define NRF_SPIM3_BIT_26 (1UL << 26)
#define NRF_SPIM3_BIT_27 (1UL << 27)
#define NRF_SPIM3_BIT_28 (1UL << 28)
#define NRF_SPIM3_BIT_29 (1UL << 29)
#define NRF_SPIM3_BIT_30 (1UL << 30)
#define NRF_SPIM3_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_TWIM0_TypeDef;
#define NRF_TWIM0 ((NRF_TWIM0_TypeDef *)0x40000000UL)

#define NRF_TWIM0_BIT_0 (1UL << 0)
#define NRF_TWIM0_BIT_1 (1UL << 1)
#define NRF_TWIM0_BIT_2 (1UL << 2)
#define NRF_TWIM0_BIT_3 (1UL << 3)
#define NRF_TWIM0_BIT_4 (1UL << 4)
#define NRF_TWIM0_BIT_5 (1UL << 5)
#define NRF_TWIM0_BIT_6 (1UL << 6)
#define NRF_TWIM0_BIT_7 (1UL << 7)
#define NRF_TWIM0_BIT_8 (1UL << 8)
#define NRF_TWIM0_BIT_9 (1UL << 9)
#define NRF_TWIM0_BIT_10 (1UL << 10)
#define NRF_TWIM0_BIT_11 (1UL << 11)
#define NRF_TWIM0_BIT_12 (1UL << 12)
#define NRF_TWIM0_BIT_13 (1UL << 13)
#define NRF_TWIM0_BIT_14 (1UL << 14)
#define NRF_TWIM0_BIT_15 (1UL << 15)
#define NRF_TWIM0_BIT_16 (1UL << 16)
#define NRF_TWIM0_BIT_17 (1UL << 17)
#define NRF_TWIM0_BIT_18 (1UL << 18)
#define NRF_TWIM0_BIT_19 (1UL << 19)
#define NRF_TWIM0_BIT_20 (1UL << 20)
#define NRF_TWIM0_BIT_21 (1UL << 21)
#define NRF_TWIM0_BIT_22 (1UL << 22)
#define NRF_TWIM0_BIT_23 (1UL << 23)
#define NRF_TWIM0_BIT_24 (1UL << 24)
#define NRF_TWIM0_BIT_25 (1UL << 25)
#define NRF_TWIM0_BIT_26 (1UL << 26)
#define NRF_TWIM0_BIT_27 (1UL << 27)
#define NRF_TWIM0_BIT_28 (1UL << 28)
#define NRF_TWIM0_BIT_29 (1UL << 29)
#define NRF_TWIM0_BIT_30 (1UL << 30)
#define NRF_TWIM0_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_TWIM1_TypeDef;
#define NRF_TWIM1 ((NRF_TWIM1_TypeDef *)0x40000000UL)

#define NRF_TWIM1_BIT_0 (1UL << 0)
#define NRF_TWIM1_BIT_1 (1UL << 1)
#define NRF_TWIM1_BIT_2 (1UL << 2)
#define NRF_TWIM1_BIT_3 (1UL << 3)
#define NRF_TWIM1_BIT_4 (1UL << 4)
#define NRF_TWIM1_BIT_5 (1UL << 5)
#define NRF_TWIM1_BIT_6 (1UL << 6)
#define NRF_TWIM1_BIT_7 (1UL << 7)
#define NRF_TWIM1_BIT_8 (1UL << 8)
#define NRF_TWIM1_BIT_9 (1UL << 9)
#define NRF_TWIM1_BIT_10 (1UL << 10)
#define NRF_TWIM1_BIT_11 (1UL << 11)
#define NRF_TWIM1_BIT_12 (1UL << 12)
#define NRF_TWIM1_BIT_13 (1UL << 13)
#define NRF_TWIM1_BIT_14 (1UL << 14)
#define NRF_TWIM1_BIT_15 (1UL << 15)
#define NRF_TWIM1_BIT_16 (1UL << 16)
#define NRF_TWIM1_BIT_17 (1UL << 17)
#define NRF_TWIM1_BIT_18 (1UL << 18)
#define NRF_TWIM1_BIT_19 (1UL << 19)
#define NRF_TWIM1_BIT_20 (1UL << 20)
#define NRF_TWIM1_BIT_21 (1UL << 21)
#define NRF_TWIM1_BIT_22 (1UL << 22)
#define NRF_TWIM1_BIT_23 (1UL << 23)
#define NRF_TWIM1_BIT_24 (1UL << 24)
#define NRF_TWIM1_BIT_25 (1UL << 25)
#define NRF_TWIM1_BIT_26 (1UL << 26)
#define NRF_TWIM1_BIT_27 (1UL << 27)
#define NRF_TWIM1_BIT_28 (1UL << 28)
#define NRF_TWIM1_BIT_29 (1UL << 29)
#define NRF_TWIM1_BIT_30 (1UL << 30)
#define NRF_TWIM1_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_PWM0_TypeDef;
#define NRF_PWM0 ((NRF_PWM0_TypeDef *)0x40000000UL)

#define NRF_PWM0_BIT_0 (1UL << 0)
#define NRF_PWM0_BIT_1 (1UL << 1)
#define NRF_PWM0_BIT_2 (1UL << 2)
#define NRF_PWM0_BIT_3 (1UL << 3)
#define NRF_PWM0_BIT_4 (1UL << 4)
#define NRF_PWM0_BIT_5 (1UL << 5)
#define NRF_PWM0_BIT_6 (1UL << 6)
#define NRF_PWM0_BIT_7 (1UL << 7)
#define NRF_PWM0_BIT_8 (1UL << 8)
#define NRF_PWM0_BIT_9 (1UL << 9)
#define NRF_PWM0_BIT_10 (1UL << 10)
#define NRF_PWM0_BIT_11 (1UL << 11)
#define NRF_PWM0_BIT_12 (1UL << 12)
#define NRF_PWM0_BIT_13 (1UL << 13)
#define NRF_PWM0_BIT_14 (1UL << 14)
#define NRF_PWM0_BIT_15 (1UL << 15)
#define NRF_PWM0_BIT_16 (1UL << 16)
#define NRF_PWM0_BIT_17 (1UL << 17)
#define NRF_PWM0_BIT_18 (1UL << 18)
#define NRF_PWM0_BIT_19 (1UL << 19)
#define NRF_PWM0_BIT_20 (1UL << 20)
#define NRF_PWM0_BIT_21 (1UL << 21)
#define NRF_PWM0_BIT_22 (1UL << 22)
#define NRF_PWM0_BIT_23 (1UL << 23)
#define NRF_PWM0_BIT_24 (1UL << 24)
#define NRF_PWM0_BIT_25 (1UL << 25)
#define NRF_PWM0_BIT_26 (1UL << 26)
#define NRF_PWM0_BIT_27 (1UL << 27)
#define NRF_PWM0_BIT_28 (1UL << 28)
#define NRF_PWM0_BIT_29 (1UL << 29)
#define NRF_PWM0_BIT_30 (1UL << 30)
#define NRF_PWM0_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_PWM1_TypeDef;
#define NRF_PWM1 ((NRF_PWM1_TypeDef *)0x40000000UL)

#define NRF_PWM1_BIT_0 (1UL << 0)
#define NRF_PWM1_BIT_1 (1UL << 1)
#define NRF_PWM1_BIT_2 (1UL << 2)
#define NRF_PWM1_BIT_3 (1UL << 3)
#define NRF_PWM1_BIT_4 (1UL << 4)
#define NRF_PWM1_BIT_5 (1UL << 5)
#define NRF_PWM1_BIT_6 (1UL << 6)
#define NRF_PWM1_BIT_7 (1UL << 7)
#define NRF_PWM1_BIT_8 (1UL << 8)
#define NRF_PWM1_BIT_9 (1UL << 9)
#define NRF_PWM1_BIT_10 (1UL << 10)
#define NRF_PWM1_BIT_11 (1UL << 11)
#define NRF_PWM1_BIT_12 (1UL << 12)
#define NRF_PWM1_BIT_13 (1UL << 13)
#define NRF_PWM1_BIT_14 (1UL << 14)
#define NRF_PWM1_BIT_15 (1UL << 15)
#define NRF_PWM1_BIT_16 (1UL << 16)
#define NRF_PWM1_BIT_17 (1UL << 17)
#define NRF_PWM1_BIT_18 (1UL << 18)
#define NRF_PWM1_BIT_19 (1UL << 19)
#define NRF_PWM1_BIT_20 (1UL << 20)
#define NRF_PWM1_BIT_21 (1UL << 21)
#define NRF_PWM1_BIT_22 (1UL << 22)
#define NRF_PWM1_BIT_23 (1UL << 23)
#define NRF_PWM1_BIT_24 (1UL << 24)
#define NRF_PWM1_BIT_25 (1UL << 25)
#define NRF_PWM1_BIT_26 (1UL << 26)
#define NRF_PWM1_BIT_27 (1UL << 27)
#define NRF_PWM1_BIT_28 (1UL << 28)
#define NRF_PWM1_BIT_29 (1UL << 29)
#define NRF_PWM1_BIT_30 (1UL << 30)
#define NRF_PWM1_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_PWM2_TypeDef;
#define NRF_PWM2 ((NRF_PWM2_TypeDef *)0x40000000UL)

#define NRF_PWM2_BIT_0 (1UL << 0)
#define NRF_PWM2_BIT_1 (1UL << 1)
#define NRF_PWM2_BIT_2 (1UL << 2)
#define NRF_PWM2_BIT_3 (1UL << 3)
#define NRF_PWM2_BIT_4 (1UL << 4)
#define NRF_PWM2_BIT_5 (1UL << 5)
#define NRF_PWM2_BIT_6 (1UL << 6)
#define NRF_PWM2_BIT_7 (1UL << 7)
#define NRF_PWM2_BIT_8 (1UL << 8)
#define NRF_PWM2_BIT_9 (1UL << 9)
#define NRF_PWM2_BIT_10 (1UL << 10)
#define NRF_PWM2_BIT_11 (1UL << 11)
#define NRF_PWM2_BIT_12 (1UL << 12)
#define NRF_PWM2_BIT_13 (1UL << 13)
#define NRF_PWM2_BIT_14 (1UL << 14)
#define NRF_PWM2_BIT_15 (1UL << 15)
#define NRF_PWM2_BIT_16 (1UL << 16)
#define NRF_PWM2_BIT_17 (1UL << 17)
#define NRF_PWM2_BIT_18 (1UL << 18)
#define NRF_PWM2_BIT_19 (1UL << 19)
#define NRF_PWM2_BIT_20 (1UL << 20)
#define NRF_PWM2_BIT_21 (1UL << 21)
#define NRF_PWM2_BIT_22 (1UL << 22)
#define NRF_PWM2_BIT_23 (1UL << 23)
#define NRF_PWM2_BIT_24 (1UL << 24)
#define NRF_PWM2_BIT_25 (1UL << 25)
#define NRF_PWM2_BIT_26 (1UL << 26)
#define NRF_PWM2_BIT_27 (1UL << 27)
#define NRF_PWM2_BIT_28 (1UL << 28)
#define NRF_PWM2_BIT_29 (1UL << 29)
#define NRF_PWM2_BIT_30 (1UL << 30)
#define NRF_PWM2_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_PWM3_TypeDef;
#define NRF_PWM3 ((NRF_PWM3_TypeDef *)0x40000000UL)

