RohithSai4518/Embeded_Systems/include/registers/reg_nrf52840.h
#define NRF_PWM3_BIT_0 (1UL << 0)
#define NRF_PWM3_BIT_1 (1UL << 1)
#define NRF_PWM3_BIT_2 (1UL << 2)
#define NRF_PWM3_BIT_3 (1UL << 3)
#define NRF_PWM3_BIT_4 (1UL << 4)
#define NRF_PWM3_BIT_5 (1UL << 5)
#define NRF_PWM3_BIT_6 (1UL << 6)
#define NRF_PWM3_BIT_7 (1UL << 7)
#define NRF_PWM3_BIT_8 (1UL << 8)
#define NRF_PWM3_BIT_9 (1UL << 9)
#define NRF_PWM3_BIT_10 (1UL << 10)
#define NRF_PWM3_BIT_11 (1UL << 11)
#define NRF_PWM3_BIT_12 (1UL << 12)
#define NRF_PWM3_BIT_13 (1UL << 13)
#define NRF_PWM3_BIT_14 (1UL << 14)
#define NRF_PWM3_BIT_15 (1UL << 15)
#define NRF_PWM3_BIT_16 (1UL << 16)
#define NRF_PWM3_BIT_17 (1UL << 17)
#define NRF_PWM3_BIT_18 (1UL << 18)
#define NRF_PWM3_BIT_19 (1UL << 19)
#define NRF_PWM3_BIT_20 (1UL << 20)
#define NRF_PWM3_BIT_21 (1UL << 21)
#define NRF_PWM3_BIT_22 (1UL << 22)
#define NRF_PWM3_BIT_23 (1UL << 23)
#define NRF_PWM3_BIT_24 (1UL << 24)
#define NRF_PWM3_BIT_25 (1UL << 25)
#define NRF_PWM3_BIT_26 (1UL << 26)
#define NRF_PWM3_BIT_27 (1UL << 27)
#define NRF_PWM3_BIT_28 (1UL << 28)
#define NRF_PWM3_BIT_29 (1UL << 29)
#define NRF_PWM3_BIT_30 (1UL << 30)
#define NRF_PWM3_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_PDM_TypeDef;
#define NRF_PDM ((NRF_PDM_TypeDef *)0x40000000UL)

#define NRF_PDM_BIT_0 (1UL << 0)
#define NRF_PDM_BIT_1 (1UL << 1)
#define NRF_PDM_BIT_2 (1UL << 2)
#define NRF_PDM_BIT_3 (1UL << 3)
#define NRF_PDM_BIT_4 (1UL << 4)
#define NRF_PDM_BIT_5 (1UL << 5)
#define NRF_PDM_BIT_6 (1UL << 6)
#define NRF_PDM_BIT_7 (1UL << 7)
#define NRF_PDM_BIT_8 (1UL << 8)
#define NRF_PDM_BIT_9 (1UL << 9)
#define NRF_PDM_BIT_10 (1UL << 10)
#define NRF_PDM_BIT_11 (1UL << 11)
#define NRF_PDM_BIT_12 (1UL << 12)
#define NRF_PDM_BIT_13 (1UL << 13)
#define NRF_PDM_BIT_14 (1UL << 14)
#define NRF_PDM_BIT_15 (1UL << 15)
#define NRF_PDM_BIT_16 (1UL << 16)
#define NRF_PDM_BIT_17 (1UL << 17)
#define NRF_PDM_BIT_18 (1UL << 18)
#define NRF_PDM_BIT_19 (1UL << 19)
#define NRF_PDM_BIT_20 (1UL << 20)
#define NRF_PDM_BIT_21 (1UL << 21)
#define NRF_PDM_BIT_22 (1UL << 22)
#define NRF_PDM_BIT_23 (1UL << 23)
#define NRF_PDM_BIT_24 (1UL << 24)
#define NRF_PDM_BIT_25 (1UL << 25)
#define NRF_PDM_BIT_26 (1UL << 26)
#define NRF_PDM_BIT_27 (1UL << 27)
#define NRF_PDM_BIT_28 (1UL << 28)
#define NRF_PDM_BIT_29 (1UL << 29)
#define NRF_PDM_BIT_30 (1UL << 30)
#define NRF_PDM_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_I2S_TypeDef;
#define NRF_I2S ((NRF_I2S_TypeDef *)0x40000000UL)

#define NRF_I2S_BIT_0 (1UL << 0)
#define NRF_I2S_BIT_1 (1UL << 1)
#define NRF_I2S_BIT_2 (1UL << 2)
#define NRF_I2S_BIT_3 (1UL << 3)
#define NRF_I2S_BIT_4 (1UL << 4)
#define NRF_I2S_BIT_5 (1UL << 5)
#define NRF_I2S_BIT_6 (1UL << 6)
#define NRF_I2S_BIT_7 (1UL << 7)
#define NRF_I2S_BIT_8 (1UL << 8)
#define NRF_I2S_BIT_9 (1UL << 9)
#define NRF_I2S_BIT_10 (1UL << 10)
#define NRF_I2S_BIT_11 (1UL << 11)
#define NRF_I2S_BIT_12 (1UL << 12)
#define NRF_I2S_BIT_13 (1UL << 13)
#define NRF_I2S_BIT_14 (1UL << 14)
#define NRF_I2S_BIT_15 (1UL << 15)
#define NRF_I2S_BIT_16 (1UL << 16)
#define NRF_I2S_BIT_17 (1UL << 17)
#define NRF_I2S_BIT_18 (1UL << 18)
#define NRF_I2S_BIT_19 (1UL << 19)
#define NRF_I2S_BIT_20 (1UL << 20)
#define NRF_I2S_BIT_21 (1UL << 21)
#define NRF_I2S_BIT_22 (1UL << 22)
#define NRF_I2S_BIT_23 (1UL << 23)
#define NRF_I2S_BIT_24 (1UL << 24)
#define NRF_I2S_BIT_25 (1UL << 25)
#define NRF_I2S_BIT_26 (1UL << 26)
#define NRF_I2S_BIT_27 (1UL << 27)
#define NRF_I2S_BIT_28 (1UL << 28)
#define NRF_I2S_BIT_29 (1UL << 29)
#define NRF_I2S_BIT_30 (1UL << 30)
#define NRF_I2S_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_QSPI_TypeDef;
#define NRF_QSPI ((NRF_QSPI_TypeDef *)0x40000000UL)

#define NRF_QSPI_BIT_0 (1UL << 0)
#define NRF_QSPI_BIT_1 (1UL << 1)
#define NRF_QSPI_BIT_2 (1UL << 2)
#define NRF_QSPI_BIT_3 (1UL << 3)
#define NRF_QSPI_BIT_4 (1UL << 4)
#define NRF_QSPI_BIT_5 (1UL << 5)
#define NRF_QSPI_BIT_6 (1UL << 6)
#define NRF_QSPI_BIT_7 (1UL << 7)
#define NRF_QSPI_BIT_8 (1UL << 8)
#define NRF_QSPI_BIT_9 (1UL << 9)
#define NRF_QSPI_BIT_10 (1UL << 10)
#define NRF_QSPI_BIT_11 (1UL << 11)
#define NRF_QSPI_BIT_12 (1UL << 12)
#define NRF_QSPI_BIT_13 (1UL << 13)
#define NRF_QSPI_BIT_14 (1UL << 14)
#define NRF_QSPI_BIT_15 (1UL << 15)
#define NRF_QSPI_BIT_16 (1UL << 16)
#define NRF_QSPI_BIT_17 (1UL << 17)
#define NRF_QSPI_BIT_18 (1UL << 18)
#define NRF_QSPI_BIT_19 (1UL << 19)
#define NRF_QSPI_BIT_20 (1UL << 20)
#define NRF_QSPI_BIT_21 (1UL << 21)
#define NRF_QSPI_BIT_22 (1UL << 22)
#define NRF_QSPI_BIT_23 (1UL << 23)
#define NRF_QSPI_BIT_24 (1UL << 24)
#define NRF_QSPI_BIT_25 (1UL << 25)
#define NRF_QSPI_BIT_26 (1UL << 26)
#define NRF_QSPI_BIT_27 (1UL << 27)
#define NRF_QSPI_BIT_28 (1UL << 28)
#define NRF_QSPI_BIT_29 (1UL << 29)
#define NRF_QSPI_BIT_30 (1UL << 30)
#define NRF_QSPI_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_NFCT_TypeDef;
#define NRF_NFCT ((NRF_NFCT_TypeDef *)0x40000000UL)

#define NRF_NFCT_BIT_0 (1UL << 0)
#define NRF_NFCT_BIT_1 (1UL << 1)
#define NRF_NFCT_BIT_2 (1UL << 2)
#define NRF_NFCT_BIT_3 (1UL << 3)
#define NRF_NFCT_BIT_4 (1UL << 4)
#define NRF_NFCT_BIT_5 (1UL << 5)
#define NRF_NFCT_BIT_6 (1UL << 6)
#define NRF_NFCT_BIT_7 (1UL << 7)
#define NRF_NFCT_BIT_8 (1UL << 8)
#define NRF_NFCT_BIT_9 (1UL << 9)
#define NRF_NFCT_BIT_10 (1UL << 10)
#define NRF_NFCT_BIT_11 (1UL << 11)
#define NRF_NFCT_BIT_12 (1UL << 12)
#define NRF_NFCT_BIT_13 (1UL << 13)
#define NRF_NFCT_BIT_14 (1UL << 14)
#define NRF_NFCT_BIT_15 (1UL << 15)
#define NRF_NFCT_BIT_16 (1UL << 16)
#define NRF_NFCT_BIT_17 (1UL << 17)
#define NRF_NFCT_BIT_18 (1UL << 18)
#define NRF_NFCT_BIT_19 (1UL << 19)
#define NRF_NFCT_BIT_20 (1UL << 20)
#define NRF_NFCT_BIT_21 (1UL << 21)
#define NRF_NFCT_BIT_22 (1UL << 22)
#define NRF_NFCT_BIT_23 (1UL << 23)
#define NRF_NFCT_BIT_24 (1UL << 24)
#define NRF_NFCT_BIT_25 (1UL << 25)
#define NRF_NFCT_BIT_26 (1UL << 26)
#define NRF_NFCT_BIT_27 (1UL << 27)
#define NRF_NFCT_BIT_28 (1UL << 28)
#define NRF_NFCT_BIT_29 (1UL << 29)
#define NRF_NFCT_BIT_30 (1UL << 30)
#define NRF_NFCT_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_USBD_TypeDef;
#define NRF_USBD ((NRF_USBD_TypeDef *)0x40000000UL)

#define NRF_USBD_BIT_0 (1UL << 0)
#define NRF_USBD_BIT_1 (1UL << 1)
#define NRF_USBD_BIT_2 (1UL << 2)
#define NRF_USBD_BIT_3 (1UL << 3)
#define NRF_USBD_BIT_4 (1UL << 4)
#define NRF_USBD_BIT_5 (1UL << 5)
#define NRF_USBD_BIT_6 (1UL << 6)
#define NRF_USBD_BIT_7 (1UL << 7)
#define NRF_USBD_BIT_8 (1UL << 8)
#define NRF_USBD_BIT_9 (1UL << 9)
#define NRF_USBD_BIT_10 (1UL << 10)
#define NRF_USBD_BIT_11 (1UL << 11)
#define NRF_USBD_BIT_12 (1UL << 12)
#define NRF_USBD_BIT_13 (1UL << 13)
#define NRF_USBD_BIT_14 (1UL << 14)
#define NRF_USBD_BIT_15 (1UL << 15)
#define NRF_USBD_BIT_16 (1UL << 16)
#define NRF_USBD_BIT_17 (1UL << 17)
#define NRF_USBD_BIT_18 (1UL << 18)
#define NRF_USBD_BIT_19 (1UL << 19)
#define NRF_USBD_BIT_20 (1UL << 20)
#define NRF_USBD_BIT_21 (1UL << 21)
#define NRF_USBD_BIT_22 (1UL << 22)
#define NRF_USBD_BIT_23 (1UL << 23)
#define NRF_USBD_BIT_24 (1UL << 24)
#define NRF_USBD_BIT_25 (1UL << 25)
#define NRF_USBD_BIT_26 (1UL << 26)
#define NRF_USBD_BIT_27 (1UL << 27)
#define NRF_USBD_BIT_28 (1UL << 28)
#define NRF_USBD_BIT_29 (1UL << 29)
#define NRF_USBD_BIT_30 (1UL << 30)
#define NRF_USBD_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_CRYPTOCELL_TypeDef;
#define NRF_CRYPTOCELL ((NRF_CRYPTOCELL_TypeDef *)0x40000000UL)

