RohithSai4518/Embeded_Systems/include/registers/reg_nrf52840.h
#define NRF_CRYPTOCELL_BIT_0 (1UL << 0)
#define NRF_CRYPTOCELL_BIT_1 (1UL << 1)
#define NRF_CRYPTOCELL_BIT_2 (1UL << 2)
#define NRF_CRYPTOCELL_BIT_3 (1UL << 3)
#define NRF_CRYPTOCELL_BIT_4 (1UL << 4)
#define NRF_CRYPTOCELL_BIT_5 (1UL << 5)
#define NRF_CRYPTOCELL_BIT_6 (1UL << 6)
#define NRF_CRYPTOCELL_BIT_7 (1UL << 7)
#define NRF_CRYPTOCELL_BIT_8 (1UL << 8)
#define NRF_CRYPTOCELL_BIT_9 (1UL << 9)
#define NRF_CRYPTOCELL_BIT_10 (1UL << 10)
#define NRF_CRYPTOCELL_BIT_11 (1UL << 11)
#define NRF_CRYPTOCELL_BIT_12 (1UL << 12)
#define NRF_CRYPTOCELL_BIT_13 (1UL << 13)
#define NRF_CRYPTOCELL_BIT_14 (1UL << 14)
#define NRF_CRYPTOCELL_BIT_15 (1UL << 15)
#define NRF_CRYPTOCELL_BIT_16 (1UL << 16)
#define NRF_CRYPTOCELL_BIT_17 (1UL << 17)
#define NRF_CRYPTOCELL_BIT_18 (1UL << 18)
#define NRF_CRYPTOCELL_BIT_19 (1UL << 19)
#define NRF_CRYPTOCELL_BIT_20 (1UL << 20)
#define NRF_CRYPTOCELL_BIT_21 (1UL << 21)
#define NRF_CRYPTOCELL_BIT_22 (1UL << 22)
#define NRF_CRYPTOCELL_BIT_23 (1UL << 23)
#define NRF_CRYPTOCELL_BIT_24 (1UL << 24)
#define NRF_CRYPTOCELL_BIT_25 (1UL << 25)
#define NRF_CRYPTOCELL_BIT_26 (1UL << 26)
#define NRF_CRYPTOCELL_BIT_27 (1UL << 27)
#define NRF_CRYPTOCELL_BIT_28 (1UL << 28)
#define NRF_CRYPTOCELL_BIT_29 (1UL << 29)
#define NRF_CRYPTOCELL_BIT_30 (1UL << 30)
#define NRF_CRYPTOCELL_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_CCM_TypeDef;
#define NRF_CCM ((NRF_CCM_TypeDef *)0x40000000UL)

#define NRF_CCM_BIT_0 (1UL << 0)
#define NRF_CCM_BIT_1 (1UL << 1)
#define NRF_CCM_BIT_2 (1UL << 2)
#define NRF_CCM_BIT_3 (1UL << 3)
#define NRF_CCM_BIT_4 (1UL << 4)
#define NRF_CCM_BIT_5 (1UL << 5)
#define NRF_CCM_BIT_6 (1UL << 6)
#define NRF_CCM_BIT_7 (1UL << 7)
#define NRF_CCM_BIT_8 (1UL << 8)
#define NRF_CCM_BIT_9 (1UL << 9)
#define NRF_CCM_BIT_10 (1UL << 10)
#define NRF_CCM_BIT_11 (1UL << 11)
#define NRF_CCM_BIT_12 (1UL << 12)
#define NRF_CCM_BIT_13 (1UL << 13)
#define NRF_CCM_BIT_14 (1UL << 14)
#define NRF_CCM_BIT_15 (1UL << 15)
#define NRF_CCM_BIT_16 (1UL << 16)
#define NRF_CCM_BIT_17 (1UL << 17)
#define NRF_CCM_BIT_18 (1UL << 18)
#define NRF_CCM_BIT_19 (1UL << 19)
#define NRF_CCM_BIT_20 (1UL << 20)
#define NRF_CCM_BIT_21 (1UL << 21)
#define NRF_CCM_BIT_22 (1UL << 22)
#define NRF_CCM_BIT_23 (1UL << 23)
#define NRF_CCM_BIT_24 (1UL << 24)
#define NRF_CCM_BIT_25 (1UL << 25)
#define NRF_CCM_BIT_26 (1UL << 26)
#define NRF_CCM_BIT_27 (1UL << 27)
#define NRF_CCM_BIT_28 (1UL << 28)
#define NRF_CCM_BIT_29 (1UL << 29)
#define NRF_CCM_BIT_30 (1UL << 30)
#define NRF_CCM_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_AAR_TypeDef;
#define NRF_AAR ((NRF_AAR_TypeDef *)0x40000000UL)

#define NRF_AAR_BIT_0 (1UL << 0)
#define NRF_AAR_BIT_1 (1UL << 1)
#define NRF_AAR_BIT_2 (1UL << 2)
#define NRF_AAR_BIT_3 (1UL << 3)
#define NRF_AAR_BIT_4 (1UL << 4)
#define NRF_AAR_BIT_5 (1UL << 5)
#define NRF_AAR_BIT_6 (1UL << 6)
#define NRF_AAR_BIT_7 (1UL << 7)
#define NRF_AAR_BIT_8 (1UL << 8)
#define NRF_AAR_BIT_9 (1UL << 9)
#define NRF_AAR_BIT_10 (1UL << 10)
#define NRF_AAR_BIT_11 (1UL << 11)
#define NRF_AAR_BIT_12 (1UL << 12)
#define NRF_AAR_BIT_13 (1UL << 13)
#define NRF_AAR_BIT_14 (1UL << 14)
#define NRF_AAR_BIT_15 (1UL << 15)
#define NRF_AAR_BIT_16 (1UL << 16)
#define NRF_AAR_BIT_17 (1UL << 17)
#define NRF_AAR_BIT_18 (1UL << 18)
#define NRF_AAR_BIT_19 (1UL << 19)
#define NRF_AAR_BIT_20 (1UL << 20)
#define NRF_AAR_BIT_21 (1UL << 21)
#define NRF_AAR_BIT_22 (1UL << 22)
#define NRF_AAR_BIT_23 (1UL << 23)
#define NRF_AAR_BIT_24 (1UL << 24)
#define NRF_AAR_BIT_25 (1UL << 25)
#define NRF_AAR_BIT_26 (1UL << 26)
#define NRF_AAR_BIT_27 (1UL << 27)
#define NRF_AAR_BIT_28 (1UL << 28)
#define NRF_AAR_BIT_29 (1UL << 29)
#define NRF_AAR_BIT_30 (1UL << 30)
#define NRF_AAR_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_RNG_TypeDef;
#define NRF_RNG ((NRF_RNG_TypeDef *)0x40000000UL)

#define NRF_RNG_BIT_0 (1UL << 0)
#define NRF_RNG_BIT_1 (1UL << 1)
#define NRF_RNG_BIT_2 (1UL << 2)
#define NRF_RNG_BIT_3 (1UL << 3)
#define NRF_RNG_BIT_4 (1UL << 4)
#define NRF_RNG_BIT_5 (1UL << 5)
#define NRF_RNG_BIT_6 (1UL << 6)
#define NRF_RNG_BIT_7 (1UL << 7)
#define NRF_RNG_BIT_8 (1UL << 8)
#define NRF_RNG_BIT_9 (1UL << 9)
#define NRF_RNG_BIT_10 (1UL << 10)
#define NRF_RNG_BIT_11 (1UL << 11)
#define NRF_RNG_BIT_12 (1UL << 12)
#define NRF_RNG_BIT_13 (1UL << 13)
#define NRF_RNG_BIT_14 (1UL << 14)
#define NRF_RNG_BIT_15 (1UL << 15)
#define NRF_RNG_BIT_16 (1UL << 16)
#define NRF_RNG_BIT_17 (1UL << 17)
#define NRF_RNG_BIT_18 (1UL << 18)
#define NRF_RNG_BIT_19 (1UL << 19)
#define NRF_RNG_BIT_20 (1UL << 20)
#define NRF_RNG_BIT_21 (1UL << 21)
#define NRF_RNG_BIT_22 (1UL << 22)
#define NRF_RNG_BIT_23 (1UL << 23)
#define NRF_RNG_BIT_24 (1UL << 24)
#define NRF_RNG_BIT_25 (1UL << 25)
#define NRF_RNG_BIT_26 (1UL << 26)
#define NRF_RNG_BIT_27 (1UL << 27)
#define NRF_RNG_BIT_28 (1UL << 28)
#define NRF_RNG_BIT_29 (1UL << 29)
#define NRF_RNG_BIT_30 (1UL << 30)
#define NRF_RNG_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_TEMP_TypeDef;
#define NRF_TEMP ((NRF_TEMP_TypeDef *)0x40000000UL)

#define NRF_TEMP_BIT_0 (1UL << 0)
#define NRF_TEMP_BIT_1 (1UL << 1)
#define NRF_TEMP_BIT_2 (1UL << 2)
#define NRF_TEMP_BIT_3 (1UL << 3)
#define NRF_TEMP_BIT_4 (1UL << 4)
#define NRF_TEMP_BIT_5 (1UL << 5)
#define NRF_TEMP_BIT_6 (1UL << 6)
#define NRF_TEMP_BIT_7 (1UL << 7)
#define NRF_TEMP_BIT_8 (1UL << 8)
#define NRF_TEMP_BIT_9 (1UL << 9)
#define NRF_TEMP_BIT_10 (1UL << 10)
#define NRF_TEMP_BIT_11 (1UL << 11)
#define NRF_TEMP_BIT_12 (1UL << 12)
#define NRF_TEMP_BIT_13 (1UL << 13)
#define NRF_TEMP_BIT_14 (1UL << 14)
#define NRF_TEMP_BIT_15 (1UL << 15)
#define NRF_TEMP_BIT_16 (1UL << 16)
#define NRF_TEMP_BIT_17 (1UL << 17)
#define NRF_TEMP_BIT_18 (1UL << 18)
#define NRF_TEMP_BIT_19 (1UL << 19)
#define NRF_TEMP_BIT_20 (1UL << 20)
#define NRF_TEMP_BIT_21 (1UL << 21)
#define NRF_TEMP_BIT_22 (1UL << 22)
#define NRF_TEMP_BIT_23 (1UL << 23)
#define NRF_TEMP_BIT_24 (1UL << 24)
#define NRF_TEMP_BIT_25 (1UL << 25)
#define NRF_TEMP_BIT_26 (1UL << 26)
#define NRF_TEMP_BIT_27 (1UL << 27)
#define NRF_TEMP_BIT_28 (1UL << 28)
#define NRF_TEMP_BIT_29 (1UL << 29)
#define NRF_TEMP_BIT_30 (1UL << 30)
#define NRF_TEMP_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_ECB_TypeDef;
#define NRF_ECB ((NRF_ECB_TypeDef *)0x40000000UL)

#define NRF_ECB_BIT_0 (1UL << 0)
#define NRF_ECB_BIT_1 (1UL << 1)
#define NRF_ECB_BIT_2 (1UL << 2)
#define NRF_ECB_BIT_3 (1UL << 3)
#define NRF_ECB_BIT_4 (1UL << 4)
#define NRF_ECB_BIT_5 (1UL << 5)
#define NRF_ECB_BIT_6 (1UL << 6)
#define NRF_ECB_BIT_7 (1UL << 7)
#define NRF_ECB_BIT_8 (1UL << 8)
#define NRF_ECB_BIT_9 (1UL << 9)
#define NRF_ECB_BIT_10 (1UL << 10)
#define NRF_ECB_BIT_11 (1UL << 11)
#define NRF_ECB_BIT_12 (1UL << 12)
#define NRF_ECB_BIT_13 (1UL << 13)
#define NRF_ECB_BIT_14 (1UL << 14)
#define NRF_ECB_BIT_15 (1UL << 15)
#define NRF_ECB_BIT_16 (1UL << 16)
#define NRF_ECB_BIT_17 (1UL << 17)
#define NRF_ECB_BIT_18 (1UL << 18)
#define NRF_ECB_BIT_19 (1UL << 19)
#define NRF_ECB_BIT_20 (1UL << 20)
#define NRF_ECB_BIT_21 (1UL << 21)
#define NRF_ECB_BIT_22 (1UL << 22)
#define NRF_ECB_BIT_23 (1UL << 23)
#define NRF_ECB_BIT_24 (1UL << 24)
#define NRF_ECB_BIT_25 (1UL << 25)
#define NRF_ECB_BIT_26 (1UL << 26)
#define NRF_ECB_BIT_27 (1UL << 27)
#define NRF_ECB_BIT_28 (1UL << 28)
#define NRF_ECB_BIT_29 (1UL << 29)
#define NRF_ECB_BIT_30 (1UL << 30)
#define NRF_ECB_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_POWER_TypeDef;
#define NRF_POWER ((NRF_POWER_TypeDef *)0x40000000UL)

