RohithSai4518/Embeded_Systems/include/registers/reg_nrf52840.h
#define NRF_POWER_BIT_0 (1UL << 0)
#define NRF_POWER_BIT_1 (1UL << 1)
#define NRF_POWER_BIT_2 (1UL << 2)
#define NRF_POWER_BIT_3 (1UL << 3)
#define NRF_POWER_BIT_4 (1UL << 4)
#define NRF_POWER_BIT_5 (1UL << 5)
#define NRF_POWER_BIT_6 (1UL << 6)
#define NRF_POWER_BIT_7 (1UL << 7)
#define NRF_POWER_BIT_8 (1UL << 8)
#define NRF_POWER_BIT_9 (1UL << 9)
#define NRF_POWER_BIT_10 (1UL << 10)
#define NRF_POWER_BIT_11 (1UL << 11)
#define NRF_POWER_BIT_12 (1UL << 12)
#define NRF_POWER_BIT_13 (1UL << 13)
#define NRF_POWER_BIT_14 (1UL << 14)
#define NRF_POWER_BIT_15 (1UL << 15)
#define NRF_POWER_BIT_16 (1UL << 16)
#define NRF_POWER_BIT_17 (1UL << 17)
#define NRF_POWER_BIT_18 (1UL << 18)
#define NRF_POWER_BIT_19 (1UL << 19)
#define NRF_POWER_BIT_20 (1UL << 20)
#define NRF_POWER_BIT_21 (1UL << 21)
#define NRF_POWER_BIT_22 (1UL << 22)
#define NRF_POWER_BIT_23 (1UL << 23)
#define NRF_POWER_BIT_24 (1UL << 24)
#define NRF_POWER_BIT_25 (1UL << 25)
#define NRF_POWER_BIT_26 (1UL << 26)
#define NRF_POWER_BIT_27 (1UL << 27)
#define NRF_POWER_BIT_28 (1UL << 28)
#define NRF_POWER_BIT_29 (1UL << 29)
#define NRF_POWER_BIT_30 (1UL << 30)
#define NRF_POWER_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_CLOCK_TypeDef;
#define NRF_CLOCK ((NRF_CLOCK_TypeDef *)0x40000000UL)

#define NRF_CLOCK_BIT_0 (1UL << 0)
#define NRF_CLOCK_BIT_1 (1UL << 1)
#define NRF_CLOCK_BIT_2 (1UL << 2)
#define NRF_CLOCK_BIT_3 (1UL << 3)
#define NRF_CLOCK_BIT_4 (1UL << 4)
#define NRF_CLOCK_BIT_5 (1UL << 5)
#define NRF_CLOCK_BIT_6 (1UL << 6)
#define NRF_CLOCK_BIT_7 (1UL << 7)
#define NRF_CLOCK_BIT_8 (1UL << 8)
#define NRF_CLOCK_BIT_9 (1UL << 9)
#define NRF_CLOCK_BIT_10 (1UL << 10)
#define NRF_CLOCK_BIT_11 (1UL << 11)
#define NRF_CLOCK_BIT_12 (1UL << 12)
#define NRF_CLOCK_BIT_13 (1UL << 13)
#define NRF_CLOCK_BIT_14 (1UL << 14)
#define NRF_CLOCK_BIT_15 (1UL << 15)
#define NRF_CLOCK_BIT_16 (1UL << 16)
#define NRF_CLOCK_BIT_17 (1UL << 17)
#define NRF_CLOCK_BIT_18 (1UL << 18)
#define NRF_CLOCK_BIT_19 (1UL << 19)
#define NRF_CLOCK_BIT_20 (1UL << 20)
#define NRF_CLOCK_BIT_21 (1UL << 21)
#define NRF_CLOCK_BIT_22 (1UL << 22)
#define NRF_CLOCK_BIT_23 (1UL << 23)
#define NRF_CLOCK_BIT_24 (1UL << 24)
#define NRF_CLOCK_BIT_25 (1UL << 25)
#define NRF_CLOCK_BIT_26 (1UL << 26)
#define NRF_CLOCK_BIT_27 (1UL << 27)
#define NRF_CLOCK_BIT_28 (1UL << 28)
#define NRF_CLOCK_BIT_29 (1UL << 29)
#define NRF_CLOCK_BIT_30 (1UL << 30)
#define NRF_CLOCK_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_NVMC_TypeDef;
#define NRF_NVMC ((NRF_NVMC_TypeDef *)0x40000000UL)

#define NRF_NVMC_BIT_0 (1UL << 0)
#define NRF_NVMC_BIT_1 (1UL << 1)
#define NRF_NVMC_BIT_2 (1UL << 2)
#define NRF_NVMC_BIT_3 (1UL << 3)
#define NRF_NVMC_BIT_4 (1UL << 4)
#define NRF_NVMC_BIT_5 (1UL << 5)
#define NRF_NVMC_BIT_6 (1UL << 6)
#define NRF_NVMC_BIT_7 (1UL << 7)
#define NRF_NVMC_BIT_8 (1UL << 8)
#define NRF_NVMC_BIT_9 (1UL << 9)
#define NRF_NVMC_BIT_10 (1UL << 10)
#define NRF_NVMC_BIT_11 (1UL << 11)
#define NRF_NVMC_BIT_12 (1UL << 12)
#define NRF_NVMC_BIT_13 (1UL << 13)
#define NRF_NVMC_BIT_14 (1UL << 14)
#define NRF_NVMC_BIT_15 (1UL << 15)
#define NRF_NVMC_BIT_16 (1UL << 16)
#define NRF_NVMC_BIT_17 (1UL << 17)
#define NRF_NVMC_BIT_18 (1UL << 18)
#define NRF_NVMC_BIT_19 (1UL << 19)
#define NRF_NVMC_BIT_20 (1UL << 20)
#define NRF_NVMC_BIT_21 (1UL << 21)
#define NRF_NVMC_BIT_22 (1UL << 22)
#define NRF_NVMC_BIT_23 (1UL << 23)
#define NRF_NVMC_BIT_24 (1UL << 24)
#define NRF_NVMC_BIT_25 (1UL << 25)
#define NRF_NVMC_BIT_26 (1UL << 26)
#define NRF_NVMC_BIT_27 (1UL << 27)
#define NRF_NVMC_BIT_28 (1UL << 28)
#define NRF_NVMC_BIT_29 (1UL << 29)
#define NRF_NVMC_BIT_30 (1UL << 30)
#define NRF_NVMC_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_FICR_TypeDef;
#define NRF_FICR ((NRF_FICR_TypeDef *)0x40000000UL)

#define NRF_FICR_BIT_0 (1UL << 0)
#define NRF_FICR_BIT_1 (1UL << 1)
#define NRF_FICR_BIT_2 (1UL << 2)
#define NRF_FICR_BIT_3 (1UL << 3)
#define NRF_FICR_BIT_4 (1UL << 4)
#define NRF_FICR_BIT_5 (1UL << 5)
#define NRF_FICR_BIT_6 (1UL << 6)
#define NRF_FICR_BIT_7 (1UL << 7)
#define NRF_FICR_BIT_8 (1UL << 8)
#define NRF_FICR_BIT_9 (1UL << 9)
#define NRF_FICR_BIT_10 (1UL << 10)
#define NRF_FICR_BIT_11 (1UL << 11)
#define NRF_FICR_BIT_12 (1UL << 12)
#define NRF_FICR_BIT_13 (1UL << 13)
#define NRF_FICR_BIT_14 (1UL << 14)
#define NRF_FICR_BIT_15 (1UL << 15)
#define NRF_FICR_BIT_16 (1UL << 16)
#define NRF_FICR_BIT_17 (1UL << 17)
#define NRF_FICR_BIT_18 (1UL << 18)
#define NRF_FICR_BIT_19 (1UL << 19)
#define NRF_FICR_BIT_20 (1UL << 20)
#define NRF_FICR_BIT_21 (1UL << 21)
#define NRF_FICR_BIT_22 (1UL << 22)
#define NRF_FICR_BIT_23 (1UL << 23)
#define NRF_FICR_BIT_24 (1UL << 24)
#define NRF_FICR_BIT_25 (1UL << 25)
#define NRF_FICR_BIT_26 (1UL << 26)
#define NRF_FICR_BIT_27 (1UL << 27)
#define NRF_FICR_BIT_28 (1UL << 28)
#define NRF_FICR_BIT_29 (1UL << 29)
#define NRF_FICR_BIT_30 (1UL << 30)
#define NRF_FICR_BIT_31 (1UL << 31)
typedef struct { volatile uint32_t TASKS_START, TASKS_STOP, TASKS_CLEAR, TASKS_TRIGGER, EVENTS_READY, EVENTS_DONE, EVENTS_ERROR, INTENSET, INTENCLR, ENABLE, CONFIG, MODE, PRESCALER, STATUS, DATA, ADDR, CNT; } NRF_UICR_TypeDef;
#define NRF_UICR ((NRF_UICR_TypeDef *)0x40000000UL)

#define NRF_UICR_BIT_0 (1UL << 0)
#define NRF_UICR_BIT_1 (1UL << 1)
#define NRF_UICR_BIT_2 (1UL << 2)
#define NRF_UICR_BIT_3 (1UL << 3)
#define NRF_UICR_BIT_4 (1UL << 4)
#define NRF_UICR_BIT_5 (1UL << 5)
#define NRF_UICR_BIT_6 (1UL << 6)
#define NRF_UICR_BIT_7 (1UL << 7)
#define NRF_UICR_BIT_8 (1UL << 8)
#define NRF_UICR_BIT_9 (1UL << 9)
#define NRF_UICR_BIT_10 (1UL << 10)
#define NRF_UICR_BIT_11 (1UL << 11)
#define NRF_UICR_BIT_12 (1UL << 12)
#define NRF_UICR_BIT_13 (1UL << 13)
#define NRF_UICR_BIT_14 (1UL << 14)
#define NRF_UICR_BIT_15 (1UL << 15)
#define NRF_UICR_BIT_16 (1UL << 16)
#define NRF_UICR_BIT_17 (1UL << 17)
#define NRF_UICR_BIT_18 (1UL << 18)
#define NRF_UICR_BIT_19 (1UL << 19)
#define NRF_UICR_BIT_20 (1UL << 20)
#define NRF_UICR_BIT_21 (1UL << 21)
#define NRF_UICR_BIT_22 (1UL << 22)
#define NRF_UICR_BIT_23 (1UL << 23)
#define NRF_UICR_BIT_24 (1UL << 24)
#define NRF_UICR_BIT_25 (1UL << 25)
#define NRF_UICR_BIT_26 (1UL << 26)
#define NRF_UICR_BIT_27 (1UL << 27)
#define NRF_UICR_BIT_28 (1UL << 28)
#define NRF_UICR_BIT_29 (1UL << 29)
#define NRF_UICR_BIT_30 (1UL << 30)
#define NRF_UICR_BIT_31 (1UL << 31)
#ifdef __cplusplus
}
#endif
#endif
